'use strict';

for (let i=0; i<1; i++) {
    var a='2';
    let b='4';
    const c='7';
    console.log(c);
}
console.log(a);
console.log(b);
console.log(c);
// Цикл for - це глобальна зміна яка доступна у всі частинах коду.
// Примітиви var, let, const є локальними змінними.
// Змінні b та c мають блочну область видомості тому вони не доступні за межами циклу, хустинг для цих змінних також відбувається але вони недоступні до моменту фактових оголошень.
// Змінна a, оголошена за допомогою var, буде доступна поза циклом.
// Спроба звернутися до b та c поза циклом призведе до помилки ReferenceError.